In [ ]:
##############=========== RAW DATA EXCEL FILE =============#############

In [123]:
import pandas as pd
df=pd.read_excel(r"C:\Users\brije\OneDrive\Documents\Raw data .xlsx")
df

    Id      Name  Lastname  Salary Department  Mobile no.
0    1     Anshu    Rajput   90000      Sales  8595787610
1    2    Manish     Kumar   62000  Marketing  8595787611
2    3     Aadil      Khan   70000    Finance  8595787612
3    4   Chandan    Thakur   80000         IT  8595787613
4    5      Aman     Anand   20000      Sales  8595787614
5    6     Badal     Singh   65000  Marketing  8595787615
6    7      Anil     Yadav   55000    Finance  8595787616
7    8     Akash     Verma   75000         IT  8595787617
8    9      Yash  Kushwaha   25000      Sales  8595787618
9   10  Abhishek     Yadav   95000  Marketing  8595787619
10  11   Aaditya     Yadav   10000    Finance  8595787620
11  12     Daksh   Chauhan   66000         IT  8595787621
12  13     Ayush     Singh   30000      Sales  8595787622
13  14      Arun     Singh   89000  Marketing  8595787623
14  15    Ashish     Rawat   90000    Finance  8595787624
15  16    Shivam    Thakur   91000         IT  8595787625
16  17     Swati    Thakur   92000      Sales  8595787626
17  18    Vineet      Ojha   93000  Marketing  8595787627
18  19    Sourav    Mathur   94000    Finance  8595787628
19  20    Yogesh    Sharma   95000         IT  8595787629

In [165]:
# Include new column i.e Tax Salary
df["Tax_salary"]=df["Salary"]*0.8
df

            Salary  Tax_salary
Department
Finance          5         4.0
IT               5         4.0
Marketing        5         4.0
Sales            5         4.0

In [107]:
df.shape

(20, 7)

In [108]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Id          20 non-null     int64
 1   Name        20 non-null     object
 2   Lastname    20 non-null     object
 3   Salary      20 non-null     int64
 4   Department  20 non-null     object
 5   Mobile no.  20 non-null     int64
 6   Tax_salary  20 non-null     float64
dtypes: float64(1), int64(3), object(3)
memory usage: 1.2+ KB

In [109]:
df["Full Name"]=df["Name"]+" "+df["Lastname"]
df

,Id,Name,Lastname,Salary,Department,Mobile no.,Tax_salary,Full Name
0,1,Anshu,Rajput,90000,Sales,8595787610,72000.0,Anshu Rajput
1,2,Manish,Kumar,62000,Marketing,8595787611,49600.0,Manish Kumar
2,3,Aadil,Khan,70000,Finance,8595787612,56000.0,Aadil Khan
3,4,Chandan,Thakur,80000,IT,8595787613,64000.0,Chandan Thakur
4,5,Aman,Anand,20000,Sales,8595787614,16000.0,Aman Anand
5,6,Badal,Singh,65000,Marketing,8595787615,52000.0,Badal Singh
6,7,Anil,Yadav,55000,Finance,8595787616,44000.0,Anil Yadav
7,8,Akash,Verma,75000,IT,8595787617,60000.0,Akash Verma
8,9,Yash,Kushwaha,25000,Sales,8595787618,20000.0,Yash Kushwaha
9,10,Abhishek,Yadav,95000,Marketing,8595787619,76000.0,Abhishek Yadav
10,11,Aaditya,Yadav,10000,Finance,8595787620,8000.0,Aaditya Yadav
11,12,Daksh,Chauhan,66000,IT,8595787621,52800.0,Daksh Chauhan
12,13,Ayush,Singh,30000,Sales,8595787622,24000.0,Ayush Singh
13,14,Arun,Singh,89000,Marketing,8595787623,71200.0,Arun Singh
14,15,Ashish,Rawat,90000,Finance,8595787624,72000.0,Ashish Rawat
15,16,Shivam,Thakur,91000,IT,8595787625,72800.0,Shivam Thakur
16,17,Swati,Thakur,92000,Sales,8595787626,73600.0,Swati Thakur
17,18,Vineet,Ojha,93000,Marketing,8595787627,74400.0,Vineet Ojha
18,19,Sourav,Mathur,94000,Finance,8595787628,75200.0,Sourav Mathur
19,20,Yogesh,Sharma,95000,IT,8595787629,76000.0,Yogesh Sharma

In [110]:
df["Lastname"].value_counts()

Lastname
Thakur      3
Singh       3
Yadav       3
Rajput      1
Kumar       1
Khan        1
Anand       1
Verma       1
Kushwaha    1
Chauhan     1
Rawat       1
Ojha        1
Mathur      1
Sharma      1
Name: count, dtype: int64

In [111]:
df["Department"].value_counts()

Department
Sales        5
Marketing    5
Finance      5
IT           5
Name: count, dtype: int64

In [132]:
p=df.groupby("Department")
p

In [113]:
for i,j in p:
    print(i)
    print(j)

Finance
    Id     Name Lastname  Salary Department  Mobile no.  Tax_salary  \
2    3    Aadil     Khan   70000    Finance  8595787612     56000.0
6    7     Anil    Yadav   55000    Finance  8595787616     44000.0
10  11  Aaditya    Yadav   10000    Finance  8595787620      8000.0
14  15   Ashish    Rawat   90000    Finance  8595787624     72000.0
18  19   Sourav   Mathur   94000    Finance  8595787628     75200.0

        Full Name
2      Aadil Khan
6      Anil Yadav
10  Aaditya Yadav
14   Ashish Rawat
18  Sourav Mathur
IT
    Id     Name Lastname  Salary Department  Mobile no.  Tax_salary  \
3    4  Chandan   Thakur   80000         IT  8595787613     64000.0
7    8    Akash    Verma   75000         IT  8595787617     60000.0
11  12    Daksh  Chauhan   66000         IT  8595787621     52800.0
15  16   Shivam   Thakur   91000         IT  8595787625     72800.0
19  20   Yogesh   Sharma   95000         IT  8595787629     76000.0

         Full Name
3   Chandan Thakur
7      Akash Verma
11   Daksh Chauhan
15   Shivam Thakur
19   Yogesh Sharma
Marketing
    Id      Name Lastname  Salary Department  Mobile no.  Tax_salary  \
1    2    Manish    Kumar   62000  Marketing  8595787611     49600.0
5    6     Badal    Singh   65000  Marketing  8595787615     52000.0
9   10  Abhishek    Yadav   95000  Marketing  8595787619     76000.0
13  14      Arun    Singh   89000  Marketing  8595787623     71200.0
17  18    Vineet     Ojha   93000  Marketing  8595787627     74400.0

         Full Name
1     Manish Kumar
5      Badal Singh
9   Abhishek Yadav
13      Arun Singh
17     Vineet Ojha
Sales
    Id   Name  Lastname  Salary Department  Mobile no.  Tax_salary  \
0    1  Anshu    Rajput   90000      Sales  8595787610     72000.0
4    5   Aman     Anand   20000      Sales  8595787614     16000.0
8    9   Yash  Kushwaha   25000      Sales  8595787618     20000.0
12  13  Ayush     Singh   30000      Sales  8595787622     24000.0
16  17  Swati    Thakur   92000      Sales  8595787626     73600.0

        Full Name
0    Anshu Rajput
4      Aman Anand
8   Yash Kushwaha
12    Ayush Singh
16   Swati Thakur

In [114]:
a=p["Salary"].sum()
a

Department
Finance      319000
IT           407000
Marketing    404000
Sales        257000
Name: Salary, dtype: int64

In [115]:
d=pd.DataFrame(a)
d

            Salary
Department
Finance     319000
IT          407000
Marketing   404000
Sales       257000

In [116]:
df=d.sort_values('Salary',ascending=False)
df

            Salary
Department
IT          407000
Marketing   404000
Finance     319000
Sales       257000

In [117]:
df[df.Salary==df["Salary"].max()]

            Salary
Department
IT          407000

In [124]:
h2=df.groupby(['Department','Lastname'])
h2

In [126]:
for i,j in h2:
    print(i)
    print(j)

('Finance', 'Khan')
   Id   Name Lastname  Salary Department  Mobile no.
2   3  Aadil     Khan   70000    Finance  8595787612
('Finance', 'Mathur')
    Id    Name Lastname  Salary Department  Mobile no.
18  19  Sourav   Mathur   94000    Finance  8595787628
('Finance', 'Rawat')
    Id    Name Lastname  Salary Department  Mobile no.
14  15  Ashish    Rawat   90000    Finance  8595787624
('Finance', 'Yadav')
    Id     Name Lastname  Salary Department  Mobile no.
6    7     Anil    Yadav   55000    Finance  8595787616
10  11  Aaditya    Yadav   10000    Finance  8595787620
('IT', 'Chauhan')
    Id   Name Lastname  Salary Department  Mobile no.
11  12  Daksh  Chauhan   66000         IT  8595787621
('IT', 'Sharma')
    Id    Name Lastname  Salary Department  Mobile no.
19  20  Yogesh   Sharma   95000         IT  8595787629
('IT', 'Thakur')
    Id     Name Lastname  Salary Department  Mobile no.
3    4  Chandan   Thakur   80000         IT  8595787613
15  16   Shivam   Thakur   91000         IT  8595787625
('IT', 'Verma')
   Id   Name Lastname  Salary Department  Mobile no.
7   8  Akash    Verma   75000         IT  8595787617
('Marketing', 'Kumar')
   Id    Name Lastname  Salary Department  Mobile no.
1   2  Manish    Kumar   62000  Marketing  8595787611
('Marketing', 'Ojha')
    Id    Name Lastname  Salary Department  Mobile no.
17  18  Vineet     Ojha   93000  Marketing  8595787627
('Marketing', 'Singh')
    Id   Name Lastname  Salary Department  Mobile no.
5    6  Badal    Singh   65000  Marketing  8595787615
13  14   Arun    Singh   89000  Marketing  8595787623
('Marketing', 'Yadav')
   Id      Name Lastname  Salary Department  Mobile no.
9  10  Abhishek    Yadav   95000  Marketing  8595787619
('Sales', 'Anand')
   Id  Name Lastname  Salary Department  Mobile no.
4   5  Aman    Anand   20000      Sales  8595787614
('Sales', 'Kushwaha')
   Id  Name  Lastname  Salary Department  Mobile no.
8   9  Yash  Kushwaha   25000      Sales  8595787618
('Sales', 'Rajput')
   Id   Name Lastname  Salary Department  Mobile no.
0   1  Anshu   Rajput   90000      Sales  8595787610
('Sales', 'Singh')
    Id   Name Lastname  Salary Department  Mobile no.
12  13  Ayush    Singh   30000      Sales  8595787622
('Sales', 'Thakur')
    Id   Name Lastname  Salary Department  Mobile no.
16  17  Swati   Thakur   92000      Sales  8595787626

In [127]:
h2["Salary"].count()

Department  Lastname
Finance     Khan        1
            Mathur      1
            Rawat       1
            Yadav       2
IT          Chauhan     1
            Sharma      1
            Thakur      2
            Verma       1
Marketing   Kumar       1
            Ojha        1
            Singh       2
            Yadav       1
Sales       Anand       1
            Kushwaha    1
            Rajput      1
            Singh       1
            Thakur      1
Name: Salary, dtype: int64

In [155]:
h=df.groupby('Department')
h

In [156]:
k=pd.DataFrame(a)
k

            Salary
Department
Finance     319000
IT          407000
Marketing   404000
Sales       257000

In [147]:
#Filtering
k[(k["Salary"]>300000)&(k["Salary"]<400000)]

            Salary
Department
Finance     319000

In [159]:
f=h["Salary"].count()
df=pd.DataFrame(f)
df

            Salary
Department
Finance          5
IT               5
Marketing        5
Sales            5

In [163]:
t=pd.concat([k,df],axis=1)
t

            Salary  Salary
Department
Finance     319000       5
IT          407000       5
Marketing   404000       5
Sales       257000       5

In [168]:
df.groupby("Department")["Salary"]